OpenROAD 7f00621cb612fd94e15b35790afe744c89d433a7 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
pdk(libs) defined as:
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
pdk(lefs) defined as:
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/__user_analog_project_wrapper.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/__user_analog_project_wrapper.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/caravel-signoff.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/caravel-signoff.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/caravan-signoff.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/caravan-signoff.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/__user_project_wrapper.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/__user_project_wrapper.v from verilogs list
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef at line 2.

[INFO ODB-0225]     Created 437 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef at line 2.

[INFO ODB-0225]     Created 22 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOR missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOL missing from liberty cell.
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 2.

[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 142.

[INFO ODB-0225]     Created 4 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef at line 2.

[INFO ODB-0225]     Created 36 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[WARNING ODB-0229] Error: library (sky130_sram_2kbyte_1rw1r_32x512_8) already exists
exec> read_lef /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
exec> read_lef /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
exec> read_lef /home/piotro/caravel_user_project/lef/icache.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/icache.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/icache.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/icache.lef
exec> read_lef /home/piotro/caravel_user_project/lef/interconnect_inner.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/interconnect_inner.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/interconnect_inner.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/interconnect_inner.lef
exec> read_lef /home/piotro/caravel_user_project/lef/interconnect_outer.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/interconnect_outer.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/interconnect_outer.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/interconnect_outer.lef
exec> read_lef /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/user_project_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
exec> read_lef /home/piotro/caravel_user_project/lef/user_proj_example.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/user_proj_example.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/user_proj_example.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/user_proj_example.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core1.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core1.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core1.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core1.lef
exec> read_lef /home/piotro/caravel_user_project/lef/dcache.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/dcache.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/dcache.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/dcache.lef
exec> read_lef /home/piotro/caravel_user_project/lef/int_ram.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/int_ram.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/int_ram.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/int_ram.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core0.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core0.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core0.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core0.lef
exec> read_def /home/piotro/caravel_user_project/def/user_project_wrapper.def
[INFO ODB-0127] Reading DEF file: /home/piotro/caravel_user_project/def/user_project_wrapper.def
[INFO ODB-0128] Design: user_project_wrapper
[INFO ODB-0130]     Created 645 pins.
[INFO ODB-0131]     Created 8 components and 2324 component-terminals.
[INFO ODB-0132]     Created 8 special nets and 16 connections.
[INFO ODB-0133]     Created 1487 nets and 2308 connections.
[INFO ODB-0134] Finished DEF file: /home/piotro/caravel_user_project/def/user_project_wrapper.def
exec> define_process_corner -ext_model_index 0 X
[INFO RCX-0431] Defined process_corner X with ext_model_index 0
[INFO RCX-0029] Defined extraction corner X
exec> extract_parasitics  -ext_model_file /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre  -lef_res
[INFO RCX-0008] extracting parasitics of user_project_wrapper ...
[INFO RCX-0435] Reading extraction model file /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre ...
[INFO RCX-0436] RC segment generation user_project_wrapper (max_merge_res 50.0) ...
[INFO RCX-0040] Final 8285 rc segments
[INFO RCX-0439] Coupling Cap extraction user_project_wrapper ...
[INFO RCX-0440] Coupling threshhold is 0.1000 fF, coupling capacitance less than 0.1000 fF will be grounded.
[INFO RCX-0043] 12638 wires to be extracted
[INFO RCX-0442] 20% completion -- 2653 wires have been extracted
[INFO RCX-0442] 27% completion -- 3508 wires have been extracted
[INFO RCX-0442] 36% completion -- 4653 wires have been extracted
[INFO RCX-0442] 42% completion -- 5376 wires have been extracted
[INFO RCX-0442] 48% completion -- 6139 wires have been extracted
[INFO RCX-0442] 73% completion -- 9337 wires have been extracted
[INFO RCX-0442] 95% completion -- 12008 wires have been extracted
[INFO RCX-0442] 100% completion -- 12638 wires have been extracted
[INFO RCX-0045] Extract 1493 nets, 9743 rsegs, 9743 caps, 13848 ccs
[INFO RCX-0015] Finished extracting user_project_wrapper.
exec> write_spef /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef
[INFO RCX-0016] Writing SPEF ...
[INFO RCX-0443] 1487 nets finished
[INFO RCX-0017] Finished writing SPEF ...
exec> read_spef /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2155, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2159, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2169, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2170, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2171, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2172, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2173, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2208, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2213, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2217, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2224, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2225, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2226, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2227, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2228, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2254, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2259, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2263, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2271, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2271, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2272, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2272, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2273, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2273, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2274, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2275, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2276, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2277, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2278, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2279, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2280, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2281, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2282, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2283, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2284, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2288, net mprj/dcache_mem_i_data\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2289, net mprj/ic0_mem_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2290, net mprj/ic0_mem_data\[25\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2291, net mprj/ic0_wb_adr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2292, net mprj/ic1_mem_data\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2293, net mprj/ic1_wb_adr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2294, net mprj/ic1_wb_i_dat\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2315, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2320, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2324, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2333, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2333, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2334, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2335, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2336, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2337, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2338, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2339, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2342, net mprj/icache_0 not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2343, net mprj/icache_0 not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2344, net mprj/dcache_mem_i_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2345, net mprj/dcache_mem_sel\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2346, net mprj/dcache_wb_o_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2347, net mprj/dcache_wb_o_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2348, net mprj/ic0_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2349, net mprj/ic0_mem_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2350, net mprj/ic0_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2351, net mprj/ic0_mem_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2352, net mprj/ic0_mem_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2353, net mprj/ic0_mem_data\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2354, net mprj/ic0_mem_data\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2355, net mprj/ic0_wb_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2356, net mprj/ic0_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2357, net mprj/ic0_wb_err not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2358, net mprj/ic0_wb_i_dat\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2359, net mprj/ic1_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2360, net mprj/ic1_mem_addr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2361, net mprj/ic1_mem_cache_flush not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2362, net mprj/ic1_wb_i_dat\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2363, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2364, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2365, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2366, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2367, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2368, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2369, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2370, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2371, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2372, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2373, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2374, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2375, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2376, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2377, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2378, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2379, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2380, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2381, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2390, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2390, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2400, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2405, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2409, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2418, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2418, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2419, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2420, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2421, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2422, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2423, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2424, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2425, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2426, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2431, net mprj/ic0_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2432, net mprj/ic0_mem_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2433, net mprj/ic0_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2434, net mprj/dcache_mem_addr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2435, net mprj/dcache_mem_i_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2436, net mprj/dcache_mem_i_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2437, net mprj/dcache_mem_i_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2438, net mprj/dcache_wb_adr\[21\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2439, net mprj/dcache_wb_o_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2440, net mprj/dcache_wb_o_dat\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2441, net mprj/ic0_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2442, net mprj/ic0_mem_data\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2443, net mprj/ic0_wb_adr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2444, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2445, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2446, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2447, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2448, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2461, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2482, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2487, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2491, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2499, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2500, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2501, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2502, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2503, net mprj/dcache_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2504, net mprj/dcache_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2505, net mprj/dcache_wb_adr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2506, net mprj/dcache_wb_adr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2507, net mprj/dcache_wb_adr\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2508, net mprj/dcache_wb_adr\[18\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2509, net mprj/dcache_wb_adr\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2510, net mprj/dcache_wb_adr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2511, net mprj/ic0_wb_adr\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2512, net mprj/ic0_wb_adr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2513, net mprj/ic0_wb_adr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2514, net mprj/ic0_wb_adr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2515, net mprj/ic0_wb_adr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2516, net mprj/ic0_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2517, net mprj/ic1_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2518, net mprj/ic1_mem_addr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2519, net mprj/ic1_mem_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2520, net mprj/ic1_wb_adr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2521, net mprj/ic1_wb_i_dat\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2527, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2528, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2529, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2530, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2531, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2532, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2554, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2559, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2563, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2570, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2570, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2571, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2571, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2572, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2573, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2574, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2575, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2576, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2577, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2578, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2579, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2580, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2581, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2582, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2597, net mprj/ic1_mem_data\[20\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2603, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2603, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2604, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2612, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2617, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2621, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2628, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2628, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2629, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2629, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2630, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2632, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2633, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2634, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2635, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2636, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2642, net mprj/ic0_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2643, net mprj/ic0_mem_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2644, net mprj/ic0_mem_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2645, net mprj/ic0_mem_data\[19\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2646, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2647, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2648, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2649, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2650, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2651, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2652, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2653, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2654, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2682, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2687, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2691, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2698, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2698, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2699, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2699, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2700, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2701, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2702, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2703, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2704, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2705, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2706, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2707, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2708, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2712, net mprj/ic0_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2713, net mprj/ic0_mem_addr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2714, net mprj/ic0_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2715, net mprj/ic0_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2716, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2724, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2724, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2725, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2737, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2742, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2746, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2752, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2752, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2753, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2753, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2754, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2755, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2756, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2757, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2758, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2759, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2760, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2768, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2773, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2773, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2774, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2782, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2787, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2791, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2796, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2796, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2797, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2797, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2798, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2798, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2799, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2799, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2800, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2800, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2801, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2802, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2803, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2804, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2805, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2806, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2807, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2808, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2809, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2810, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2811, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2812, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2813, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2814, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2818, net mprj/dcache_mem_i_data\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2819, net mprj/dcache_mem_o_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2820, net mprj/dcache_wb_4_burst not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2821, net mprj/dcache_wb_adr\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2822, net mprj/dcache_wb_i_dat\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2823, net mprj/dcache_wb_o_dat\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2824, net mprj/ic0_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2825, net mprj/ic0_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2826, net mprj/ic0_mem_data\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2827, net mprj/ic0_mem_data\[24\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2828, net mprj/ic0_wb_adr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2829, net mprj/ic0_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2830, net mprj/ic1_mem_data\[21\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2831, net mprj/ic1_wb_adr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2832, net mprj/ic1_wb_i_dat\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2833, net mprj/ic1_wb_i_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2834, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2834, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2835, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2842, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2847, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2851, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2857, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2857, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2858, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2859, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2860, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2868, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2869, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2870, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2886, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2891, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2895, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2900, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2900, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2901, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2902, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2903, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2904, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2905, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2907, net mprj/dcache_mem_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2908, net mprj/dcache_mem_addr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2909, net mprj/dcache_mem_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2910, net mprj/dcache_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2911, net mprj/dcache_mem_i_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2912, net mprj/dcache_mem_o_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2913, net mprj/dcache_mem_o_data\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2914, net mprj/dcache_wb_i_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2915, net mprj/ic0_clk not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2916, net mprj/ic0_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2917, net mprj/ic0_mem_cache_flush not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2918, net mprj/ic1_mem_data\[29\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2919, net mprj/ic1_mem_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2920, net mprj/ic1_mem_data\[30\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2921, net mprj/ic1_mem_data\[31\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2922, net mprj/ic1_mem_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2923, net mprj/ic1_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2924, net mprj/ic1_wb_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2925, net mprj/ic1_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2926, net mprj/ic1_wb_adr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2927, net mprj/ic1_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2928, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2929, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2930, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2931, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2932, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2933, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2934, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2935, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2936, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2953, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2958, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2962, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2968, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2969, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2970, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2971, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2972, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2973, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2973, net mprj/iram_clk not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2980, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2980, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2981, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2981, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2982, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2989, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2994, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 2998, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3005, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3005, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3006, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3007, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3008, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3009, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3018, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3019, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3031, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3036, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3040, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3046, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3046, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3047, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3048, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3049, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3050, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3051, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3052, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3053, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3054, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3055, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3056, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3057, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3058, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3059, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3065, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3066, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3067, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3068, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3069, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3070, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3071, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3072, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3073, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3074, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3093, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3093, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3094, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3094, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3103, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3108, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3112, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3117, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3117, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3118, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3118, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3119, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3119, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3120, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3120, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3121, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3121, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3122, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3122, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3123, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3124, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3125, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3126, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3127, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3128, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3129, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3130, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3131, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3132, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3133, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3134, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3135, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3136, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3137, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3138, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3139, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3140, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3141, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3143, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3143, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3151, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3156, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3160, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3167, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3167, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3169, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3170, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3171, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3172, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3173, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3174, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3175, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3176, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3177, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3178, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3179, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3180, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3181, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3182, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3183, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3184, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3185, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3188, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3189, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3190, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3192, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3193, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3207, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3207, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3208, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3208, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3209, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3209, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3218, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3223, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3227, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3238, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3239, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3240, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3241, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3242, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3243, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3244, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3245, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3253, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3254, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3255, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3256, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3262, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3263, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3285, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3290, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3294, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3305, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3305, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3306, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3307, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3308, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3323, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3340, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3345, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3349, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3359, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3359, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3360, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3360, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3361, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3361, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3362, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3362, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3363, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3363, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3364, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3365, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3366, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3367, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3368, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3369, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3370, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3371, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3372, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3373, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3374, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3375, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3376, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3382, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3383, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3387, net mprj/iram_i_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3388, net mprj/iram_i_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3389, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3390, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3394, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3394, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3395, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3395, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3396, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3396, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3412, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3417, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3421, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3428, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3428, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3429, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3429, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3430, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3431, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3432, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3441, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3441, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3452, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3457, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3461, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3468, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3469, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3470, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3471, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3472, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3481, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3481, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3484, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3492, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3497, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3501, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3508, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3508, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3509, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3510, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3511, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3512, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3513, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3514, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3515, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3517, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3518, net mprj/c1_i_req_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3519, net mprj/c1_o_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3520, net mprj/c1_o_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3532, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3532, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3540, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3545, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3549, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3555, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3555, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3556, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3556, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3557, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3558, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3559, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3560, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3561, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3562, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3563, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3564, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3565, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3566, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3567, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3568, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3569, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3570, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3571, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3572, net mprj/c0_o_mem_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3573, net mprj/c0_o_req_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3574, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3575, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3576, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3577, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3578, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3579, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3585, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3585, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3586, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3587, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3587, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3599, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3604, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3608, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3619, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3619, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3620, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3621, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3622, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3623, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3624, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3625, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3626, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3627, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3628, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3629, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3630, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3632, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3638, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3639, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3640, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3641, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3642, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3643, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3644, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3645, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3646, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3650, net mprj/iram_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3651, net mprj/iram_addr\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3652, net mprj/iram_addr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3653, net mprj/iram_addr\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3654, net mprj/iram_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3655, net mprj/iram_addr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3656, net mprj/iram_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3657, net mprj/iram_i_data\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3658, net mprj/iram_i_data\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3659, net mprj/iram_i_data\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3660, net mprj/iram_i_data\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3661, net mprj/iram_i_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3662, net mprj/iram_i_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3663, net mprj/iram_i_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3664, net mprj/iram_i_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3665, net mprj/iram_i_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3666, net mprj/iram_i_data\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3667, net mprj/iram_o_data\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3668, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3673, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3673, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3674, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3675, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3690, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3695, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3699, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3708, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3708, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3709, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3709, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3710, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3710, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3711, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3711, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3712, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3713, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3714, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3715, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3716, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3717, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3718, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3719, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3720, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3721, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3722, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3723, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3724, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3725, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3734, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3734, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3744, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3749, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3753, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3760, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3760, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3761, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3762, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3763, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3764, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3765, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3766, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3767, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3768, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3769, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3770, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3771, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3772, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3779, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3780, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3781, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3789, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3789, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3790, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3790, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3802, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3807, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3811, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3822, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3822, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3823, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3823, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3824, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3824, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3825, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3826, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3827, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3828, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3829, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3830, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3831, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3832, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3833, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3834, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3835, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3836, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3837, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3842, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3842, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3843, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3843, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3844, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3844, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3845, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3858, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3863, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3867, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3876, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3877, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3878, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3879, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3880, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3887, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3908, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3913, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3917, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3922, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3922, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3923, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3924, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3925, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3926, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3927, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3937, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3937, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3938, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3938, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3939, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3940, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3947, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3952, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3956, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3962, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3962, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3963, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3964, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3965, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3966, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3978, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3986, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3991, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 3995, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4000, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4000, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4001, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4002, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4003, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4004, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4005, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4006, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4007, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4008, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4022, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4022, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4023, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4030, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4035, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4039, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4045, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4046, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4047, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4048, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4049, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4050, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4063, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4063, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4064, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4064, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4072, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4077, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4081, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4086, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4087, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4088, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4089, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4090, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4091, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4092, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4093, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4094, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4095, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4096, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4097, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4114, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4119, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4123, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4129, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4130, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4131, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4132, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4151, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4152, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4163, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4168, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4172, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4180, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4180, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4181, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4182, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4183, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4184, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4185, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4186, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4187, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4188, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4189, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4190, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4192, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4193, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4194, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4201, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4202, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4214, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4215, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4225, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4225, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4226, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4226, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4227, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4227, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4228, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4228, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4229, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4232, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4241, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4246, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4250, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4259, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4260, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4261, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4262, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4263, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4264, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4265, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4266, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4267, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4268, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4269, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4274, net mprj/dcache not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4275, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4276, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4286, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4286, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4287, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4287, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4288, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4289, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4289, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4290, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4292, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4293, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4304, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4309, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4313, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4319, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4322, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4323, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4328, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4331, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4340, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4344, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4353, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4366, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4367, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4368, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4369, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4370, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4371, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4388, net mprj/dcache_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4389, net mprj/dcache_mem_i_data\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4393, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4394, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4395, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4396, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4397, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4398, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4407, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4420, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4424, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4437, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4438, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4439, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4440, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4441, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4450, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4451, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4452, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4453, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4454, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4455, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4472, net mprj/dcache_mem_o_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4473, net mprj/dcache_wb_err not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4474, net mprj/dcache_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4475, net mprj/ic0_mem_req not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4476, net mprj/ic0_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4477, net mprj/ic1_mem_data\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4478, net mprj/ic1_wb_i_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4483, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4484, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4493, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4506, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4510, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4532, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4533, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4534, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4535, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4536, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4554, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4555, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4556, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4557, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4558, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4559, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4566, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4579, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4583, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4592, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4600, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4601, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4604, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4605, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4606, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4607, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4608, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4609, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4610, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4611, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4612, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4632, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4633, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4634, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4643, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4656, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4660, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4668, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4675, net mprj/dcache_mem_addr\[19\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4676, net mprj/dcache_mem_o_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4677, net mprj/dcache_wb_we not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4678, net mprj/ic0_mem_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4679, net mprj/ic1_mem_data\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4680, net mprj/ic1_wb_adr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4681, net mprj/ic1_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4682, net mprj/ic1_wb_sel\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4683, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4684, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4685, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4687, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4697, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4701, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4723, net mprj/ic0_mem_addr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4724, net mprj/ic0_mem_addr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4725, net mprj/ic0_mem_data\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4729, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4730, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4731, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4732, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4739, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4750, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4754, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4763, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4764, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4765, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4766, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4767, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4768, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4769, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4770, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4771, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4781, net mprj/dcache_mem_addr\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4782, net mprj/dcache_mem_addr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4783, net mprj/dcache_mem_o_data\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4784, net mprj/dcache_wb_i_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4785, net mprj/dcache_wb_o_dat\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4786, net mprj/ic0_mem_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4787, net mprj/ic1_mem_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4788, net mprj/ic1_wb_i_dat\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4791, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4792, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4793, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4794, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4800, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4810, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4814, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4825, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4834, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4835, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4836, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4844, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4855, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4859, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4878, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4885, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4886, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4897, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4898, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4899, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4900, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4906, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4919, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4923, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4932, net mprj/interconnect_outer not found.
[WARNING STA-0174] message limit reached, this message will no longer print
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 4980, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5026, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5172, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5219, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5258, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5317, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5371, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5441, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5490, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5537, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5584, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5633, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5669, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5738, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5822, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5889, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 5946, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6027, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6069, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6113, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6167, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6217, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6256, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6295, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6340, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6430, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6590, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6661, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6704, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6769, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6814, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6877, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 6946, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7025, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7077, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7123, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7170, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7258, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7369, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7412, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7493, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7542, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7598, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7671, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7722, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7772, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7835, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7893, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 7954, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8003, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8047, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8097, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8158, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8214, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8274, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8323, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8367, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8415, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8453, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8497, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8544, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8582, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8637, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8745, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8818, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8900, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8942, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 8998, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9059, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9112, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9155, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9197, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9243, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9356, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9405, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9455, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9510, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9564, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9626, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9670, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9715, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9772, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9805, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9850, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9906, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9950, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 9989, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10033, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10075, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10115, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10156, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10195, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10241, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10279, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10318, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10358, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10409, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10443, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10490, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10529, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10566, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10596, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10634, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10675, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10720, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10753, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10808, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10849, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10894, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10941, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 10991, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11062, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11102, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11162, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11204, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11243, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11281, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11332, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11414, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11447, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11505, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11541, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11577, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11638, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11682, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11724, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11765, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11801, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11867, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11907, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11944, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 11982, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12028, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12082, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12133, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12178, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12219, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12271, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12313, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12358, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12405, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12442, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12487, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12520, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12577, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12627, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12668, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12708, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12754, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12792, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12837, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12886, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12929, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 12969, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13013, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13065, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13102, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13144, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13182, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13217, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13264, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13337, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13392, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13439, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13475, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13523, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13589, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13628, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13675, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13720, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13752, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13791, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13845, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13893, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13934, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 13979, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14015, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14076, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14120, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14155, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14197, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14237, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14274, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14345, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14404, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14455, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14492, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14532, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14571, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14615, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14663, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14702, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14742, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14782, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14823, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14870, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14915, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14956, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 14997, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15039, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15080, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15123, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15164, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15209, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15252, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15304, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15344, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15388, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15435, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15486, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15535, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15578, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15620, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15667, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15703, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15746, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15805, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15851, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15892, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15931, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 15964, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16002, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16034, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16071, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16105, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16145, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16176, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16211, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16246, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16289, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16330, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16362, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16398, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16423, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16463, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16521, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16561, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16597, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16644, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16688, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16735, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16785, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16814, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16854, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16897, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 16977, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17025, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17066, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17110, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17153, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17202, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17241, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17287, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17324, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17371, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17407, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17449, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17483, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17524, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17559, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17602, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17646, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17688, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17731, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17771, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17810, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17854, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17892, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17932, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 17972, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18015, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18056, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18107, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18151, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18194, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18226, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18267, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18347, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18386, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18434, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18483, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18523, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18560, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18604, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18641, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18683, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18733, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18773, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18818, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18864, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18911, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18951, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 18996, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19035, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19079, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19125, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19172, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19213, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19247, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19288, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19325, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19368, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19415, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19453, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19492, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19532, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19568, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19615, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19665, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19698, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19741, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19779, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19824, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19868, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19913, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19953, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 19999, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20042, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20083, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20143, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20179, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20223, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20259, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20302, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20353, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20392, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20435, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20478, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20524, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20572, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20617, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20658, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20699, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20740, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20781, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20826, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20874, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20911, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20946, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 20993, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21037, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21072, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21100, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21140, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21180, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21219, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21259, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21310, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21338, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21374, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21409, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21455, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21486, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21520, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21563, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21599, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21638, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21687, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21731, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21763, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21804, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21842, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21879, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21921, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 21957, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22000, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22038, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22084, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22126, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22175, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22210, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22253, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22298, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22334, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22372, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22409, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22453, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22531, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22574, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22623, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22656, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22693, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22729, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22773, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22814, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22852, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22894, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22938, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 22979, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23034, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23074, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23117, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23157, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23197, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23246, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23289, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23329, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23377, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23419, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23461, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23502, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23544, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23588, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23631, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23668, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23711, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23747, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23799, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23836, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23876, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23922, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 23971, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24013, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24063, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24100, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24150, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24191, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24236, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24278, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24311, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24355, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24397, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24442, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24493, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24544, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24587, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24640, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24685, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24726, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24772, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24840, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24884, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24943, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 24982, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25043, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25085, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25124, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25183, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25234, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25352, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25404, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25444, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25497, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25540, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25580, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25635, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25683, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25724, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25770, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25812, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25893, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25935, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 25974, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26012, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26046, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26093, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26140, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26185, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26233, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26279, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26326, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26365, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26417, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26452, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26496, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26533, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26572, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26620, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26666, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26702, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26744, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26778, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26817, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26862, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26908, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26949, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 26990, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27031, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27068, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27112, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27148, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27186, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27230, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27278, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27353, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27387, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27428, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27467, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27506, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27546, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27586, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27628, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27669, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27704, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27740, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27781, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27818, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27856, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27898, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27938, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 27978, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28019, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28062, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28104, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28138, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28174, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28214, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28256, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28294, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28331, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28372, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28406, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28444, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28484, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28527, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28566, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28604, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28643, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28682, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28726, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28767, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28804, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28847, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28884, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28925, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 28964, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29001, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29032, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29071, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29110, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29151, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29200, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29252, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29293, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29331, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29372, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29417, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29452, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29497, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29540, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29583, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29627, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29675, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29718, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29770, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29808, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29857, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29903, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 29961, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30012, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30060, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30100, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30134, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30174, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30213, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30250, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30251, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30275, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30276, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30321, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30322, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30355, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30356, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30388, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30389, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30419, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30420, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30451, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30452, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30481, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30482, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30545, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30546, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30584, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30585, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30630, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30631, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30663, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30664, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30700, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30701, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30729, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30730, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30767, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30768, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30806, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30807, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30844, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30845, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30880, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30881, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30914, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30915, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30952, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30953, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30989, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 30990, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31027, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31028, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31066, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31067, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31104, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31105, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31147, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31148, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31189, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31190, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31230, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31231, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31261, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31262, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31293, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31294, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31327, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31328, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31358, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31359, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31393, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31394, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31426, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31427, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31466, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31467, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31502, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31503, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31535, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31536, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31567, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31568, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31598, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31599, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31628, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31629, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31665, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31666, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31699, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31700, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31851, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31852, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31888, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31889, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31923, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31924, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31960, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31961, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31993, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 31994, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32038, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32039, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32077, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32078, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32113, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32114, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32146, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32147, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32180, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32181, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32213, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32214, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32242, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32243, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32283, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32284, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32323, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32324, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32357, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32358, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32391, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32392, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32429, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32430, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32462, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32463, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32499, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32500, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32538, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32539, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32570, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32571, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32608, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32609, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32647, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32648, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32693, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32694, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32733, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32734, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32770, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32771, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32804, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32805, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32836, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32837, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32867, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32868, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32899, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32900, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32931, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32932, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32969, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 32970, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33003, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33004, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33032, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33033, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33068, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33069, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33105, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33106, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33141, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33142, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33176, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33177, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33215, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33216, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33255, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33256, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33309, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33310, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33343, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33344, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33409, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33410, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33442, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33443, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33479, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33480, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33510, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33511, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33547, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33548, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33576, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33577, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33609, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33610, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33643, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33644, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33683, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33684, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33721, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33722, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33753, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33754, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33784, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33785, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33814, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33815, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33845, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33846, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33888, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33889, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33919, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33920, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33953, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33954, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33983, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 33984, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34019, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34020, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34054, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34055, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34084, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34085, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34133, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34134, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34169, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34170, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34206, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34207, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34241, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34242, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34274, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34275, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34305, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34306, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34344, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34345, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34381, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34382, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34415, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34416, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34448, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34449, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34486, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34487, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34519, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34520, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34551, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34552, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34586, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34587, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34662, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34663, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34697, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34698, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34730, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34731, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34781, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34782, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34816, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34817, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34848, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34849, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34883, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34884, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34917, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34918, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34952, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34953, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34990, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 34991, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35024, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35025, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35061, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35062, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35101, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35102, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35141, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35142, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35177, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35178, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35212, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35213, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35251, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35252, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35286, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35287, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35322, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35323, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35360, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35361, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35392, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35393, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35426, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35427, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35462, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35463, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35500, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35501, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35536, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35537, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35573, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35574, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35606, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35607, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35647, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35648, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35686, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35687, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35723, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35724, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35760, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35761, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35797, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35798, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35830, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35831, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35865, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35866, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35899, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35900, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35936, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35937, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35971, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 35972, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36003, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36004, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36033, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36034, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36073, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36074, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36119, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36120, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36148, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36149, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36180, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36181, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36216, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36217, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36250, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36251, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36289, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36290, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36328, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36329, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36370, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36371, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36407, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36408, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36449, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36450, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36489, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36490, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36528, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36529, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36564, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36565, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36598, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36599, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36635, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36636, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36670, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36671, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36701, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36702, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36736, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36737, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36776, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36777, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36814, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36815, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36849, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36850, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36889, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36890, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36928, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36929, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36965, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 36966, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37004, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37005, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37044, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37045, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37082, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37083, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37116, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37117, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37158, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37159, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37192, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37193, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37230, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37231, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37264, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37265, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37296, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37297, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37332, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37333, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37367, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37368, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37400, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37401, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37434, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37435, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37470, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef line 37471, instance mprj/core0 not found.
[WARNING STA-0172] message limit reached, this message will no longer print
spef: /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.min.spef
def: /home/piotro/caravel_user_project/def/user_project_wrapper.def
rcx: /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.min.calibre
rcx-corner: min
lib-corner: t.tcl
tech_lef: /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__min.tlef
