OpenROAD 7f00621cb612fd94e15b35790afe744c89d433a7 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
pdk(libs) defined as:
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
pdk(lefs) defined as:
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__nom.tlef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
/home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/__user_analog_project_wrapper.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/__user_analog_project_wrapper.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/caravel-signoff.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/caravel-signoff.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/caravan-signoff.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/caravan-signoff.v from verilogs list
verilog exception: /home/piotro/caravel_user_project/caravel/verilog/gl/__user_project_wrapper.v
removing /home/piotro/caravel_user_project/caravel/verilog/gl/__user_project_wrapper.v from verilogs list
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hvl/lib/sky130_fd_sc_hvl__tt_025C_3v30_lv1v80.lib
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_gpiov2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_hvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_ground_lvc_wpad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_power_lvc_wpad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_fd_io__top_xres4v2_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__gpiov2_pad_tt_tt_025C_1v80_3v30.lib line 33, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vdda_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssa_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vddio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssio_hvc_clamped_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped3_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vccd_lvc_clamped3_pad_tt_025C_1v80_3v30_3v30.lib line 42, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib
[WARNING STA-0163] /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lib/sky130_ef_io__vssd_lvc_clamped_pad_tt_025C_1v80_3v30.lib line 43, default_fanout_load is 0.0.
exec> read_liberty /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lib/sky130_sram_2kbyte_1rw1r_32x512_8_TT_1p8V_25C.lib
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__nom.tlef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__nom.tlef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__nom.tlef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef at line 2.

[INFO ODB-0225]     Created 437 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_fd_sc_hd.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_fd_io.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef at line 2.

[INFO ODB-0225]     Created 22 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_fd_io.lef
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOR missing from liberty cell.
[WARNING ORD-1001] LEF macro sky130_fd_io__top_ground_hvc_wpad pin PADISOL missing from liberty cell.
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 2.

[WARNING ODB-0220] WARNING (LEFPARS-2036): SOURCE statement is obsolete in version 5.6 and later.
The LEF parser will ignore this statement.
To avoid this warning in the future, remove this statement from the LEF file with version 5.6 or later. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef at line 142.

[INFO ODB-0225]     Created 4 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_sc_hd/lef/sky130_ef_sc_hd.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_io/lef/sky130_ef_io.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef at line 2.

[INFO ODB-0225]     Created 36 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_fd_io/lef/sky130_ef_io.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/opt/silicon/pdks/sky130A/libs.ref/sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
exec> read_lef /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_sram_macros/lef/sky130_sram_2kbyte_1rw1r_32x512_8.lef
[WARNING ODB-0229] Error: library (sky130_sram_2kbyte_1rw1r_32x512_8) already exists
exec> read_lef /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/caravel/lef/user_analog_project_wrapper_empty.lef
exec> read_lef /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/caravel/lef/user_project_wrapper_empty.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM256.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/RAM128.lef
exec> read_lef /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/mgmt_core_wrapper/lef/mgmt_core_wrapper.lef
exec> read_lef /home/piotro/caravel_user_project/lef/icache.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/icache.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/icache.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/icache.lef
exec> read_lef /home/piotro/caravel_user_project/lef/interconnect_inner.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/interconnect_inner.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/interconnect_inner.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/interconnect_inner.lef
exec> read_lef /home/piotro/caravel_user_project/lef/interconnect_outer.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/interconnect_outer.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/interconnect_outer.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/interconnect_outer.lef
exec> read_lef /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/user_project_wrapper.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/user_project_wrapper.lef
exec> read_lef /home/piotro/caravel_user_project/lef/user_proj_example.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/user_proj_example.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/user_proj_example.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/user_proj_example.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core1.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core1.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core1.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core1.lef
exec> read_lef /home/piotro/caravel_user_project/lef/dcache.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/dcache.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/dcache.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/dcache.lef
exec> read_lef /home/piotro/caravel_user_project/lef/int_ram.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/int_ram.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/int_ram.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/int_ram.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core.lef
exec> read_lef /home/piotro/caravel_user_project/lef/core0.lef
[INFO ODB-0222] Reading LEF file: /home/piotro/caravel_user_project/lef/core0.lef
[WARNING ODB-0220] WARNING (LEFPARS-2008): NOWIREEXTENSIONATPIN statement is obsolete in version 5.6 or later.
The NOWIREEXTENSIONATPIN statement will be ignored. See file /home/piotro/caravel_user_project/lef/core0.lef at line 2.

[INFO ODB-0225]     Created 1 library cells
[INFO ODB-0226] Finished LEF file:  /home/piotro/caravel_user_project/lef/core0.lef
exec> read_def /home/piotro/caravel_user_project/def/user_project_wrapper.def
[INFO ODB-0127] Reading DEF file: /home/piotro/caravel_user_project/def/user_project_wrapper.def
[INFO ODB-0128] Design: user_project_wrapper
[INFO ODB-0130]     Created 645 pins.
[INFO ODB-0131]     Created 8 components and 2324 component-terminals.
[INFO ODB-0132]     Created 8 special nets and 16 connections.
[INFO ODB-0133]     Created 1487 nets and 2308 connections.
[INFO ODB-0134] Finished DEF file: /home/piotro/caravel_user_project/def/user_project_wrapper.def
exec> define_process_corner -ext_model_index 0 X
[INFO RCX-0431] Defined process_corner X with ext_model_index 0
[INFO RCX-0029] Defined extraction corner X
exec> extract_parasitics  -ext_model_file /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.nom.calibre  -lef_res
[INFO RCX-0008] extracting parasitics of user_project_wrapper ...
[INFO RCX-0435] Reading extraction model file /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.nom.calibre ...
[INFO RCX-0436] RC segment generation user_project_wrapper (max_merge_res 50.0) ...
[INFO RCX-0040] Final 8877 rc segments
[INFO RCX-0439] Coupling Cap extraction user_project_wrapper ...
[INFO RCX-0440] Coupling threshhold is 0.1000 fF, coupling capacitance less than 0.1000 fF will be grounded.
[INFO RCX-0043] 12638 wires to be extracted
[INFO RCX-0442] 20% completion -- 2653 wires have been extracted
[INFO RCX-0442] 27% completion -- 3508 wires have been extracted
[INFO RCX-0442] 36% completion -- 4653 wires have been extracted
[INFO RCX-0442] 42% completion -- 5376 wires have been extracted
[INFO RCX-0442] 48% completion -- 6139 wires have been extracted
[INFO RCX-0442] 73% completion -- 9337 wires have been extracted
[INFO RCX-0442] 95% completion -- 12008 wires have been extracted
[INFO RCX-0442] 100% completion -- 12638 wires have been extracted
[INFO RCX-0045] Extract 1493 nets, 10335 rsegs, 10335 caps, 14126 ccs
[INFO RCX-0015] Finished extracting user_project_wrapper.
exec> write_spef /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef
[INFO RCX-0016] Writing SPEF ...
[INFO RCX-0443] 1487 nets finished
[INFO RCX-0017] Finished writing SPEF ...
exec> read_spef /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2155, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2159, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2168, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2169, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2170, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2171, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2172, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2173, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2208, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2213, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2217, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2224, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2225, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2226, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2227, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2228, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2254, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2259, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2263, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2272, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2272, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2273, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2273, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2274, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2274, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2275, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2276, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2277, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2278, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2279, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2280, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2281, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2282, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2283, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2284, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2285, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2289, net mprj/dcache_mem_i_data\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2290, net mprj/ic0_mem_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2291, net mprj/ic0_mem_data\[25\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2292, net mprj/ic0_wb_adr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2293, net mprj/ic1_mem_data\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2294, net mprj/ic1_wb_adr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2295, net mprj/ic1_wb_i_dat\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2317, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2322, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2326, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2335, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2335, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2336, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2337, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2338, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2339, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2340, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2341, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2344, net mprj/icache_0 not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2345, net mprj/dcache_mem_i_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2346, net mprj/dcache_mem_sel\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2347, net mprj/dcache_wb_o_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2348, net mprj/dcache_wb_o_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2349, net mprj/ic0_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2350, net mprj/ic0_mem_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2351, net mprj/ic0_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2352, net mprj/ic0_mem_cache_flush not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2353, net mprj/ic0_mem_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2354, net mprj/ic0_mem_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2355, net mprj/ic0_mem_data\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2356, net mprj/ic0_mem_data\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2357, net mprj/ic0_wb_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2358, net mprj/ic0_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2359, net mprj/ic0_wb_err not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2360, net mprj/ic0_wb_i_dat\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2361, net mprj/ic1_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2362, net mprj/ic1_mem_addr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2363, net mprj/ic1_mem_cache_flush not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2364, net mprj/ic1_wb_i_dat\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2365, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2366, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2367, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2368, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2369, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2370, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2371, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2372, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2373, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2374, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2375, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2376, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2377, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2378, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2379, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2380, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2381, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2382, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2383, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2392, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2392, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2402, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2407, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2411, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2420, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2421, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2422, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2423, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2424, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2425, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2426, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2427, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2428, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2433, net mprj/ic0_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2434, net mprj/ic0_mem_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2435, net mprj/ic0_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2436, net mprj/dcache_mem_addr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2437, net mprj/dcache_mem_i_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2438, net mprj/dcache_mem_i_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2439, net mprj/dcache_mem_i_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2440, net mprj/dcache_wb_adr\[21\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2441, net mprj/dcache_wb_o_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2442, net mprj/dcache_wb_o_dat\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2443, net mprj/ic0_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2444, net mprj/ic0_mem_data\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2445, net mprj/ic0_wb_adr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2446, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2447, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2448, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2464, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2465, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2485, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2490, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2494, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2502, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2502, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2503, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2503, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2504, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2504, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2505, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2506, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2507, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2508, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2509, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2510, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2511, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2512, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2513, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2514, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2515, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2516, net mprj/dcache_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2517, net mprj/dcache_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2518, net mprj/dcache_wb_adr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2519, net mprj/dcache_wb_adr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2520, net mprj/dcache_wb_adr\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2521, net mprj/dcache_wb_adr\[18\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2522, net mprj/dcache_wb_adr\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2523, net mprj/dcache_wb_adr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2524, net mprj/ic0_wb_adr\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2525, net mprj/ic0_wb_adr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2526, net mprj/ic0_wb_adr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2527, net mprj/ic0_wb_adr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2528, net mprj/ic0_wb_adr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2529, net mprj/ic0_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2530, net mprj/ic1_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2531, net mprj/ic1_mem_addr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2532, net mprj/ic1_mem_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2533, net mprj/ic1_wb_adr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2534, net mprj/ic1_wb_i_dat\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2540, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2541, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2542, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2557, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2562, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2566, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2573, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2573, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2574, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2575, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2576, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2577, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2578, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2579, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2580, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2581, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2582, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2583, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2584, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2585, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2600, net mprj/ic1_mem_data\[20\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2606, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2606, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2607, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2607, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2615, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2620, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2624, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2632, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2633, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2634, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2635, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2636, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2637, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2638, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2639, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2645, net mprj/ic0_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2646, net mprj/ic0_mem_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2647, net mprj/ic0_mem_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2648, net mprj/ic0_mem_data\[19\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2649, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2650, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2651, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2652, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2653, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2654, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2655, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2656, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2686, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2691, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2695, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2702, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2702, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2703, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2703, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2704, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2705, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2706, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2707, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2708, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2709, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2710, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2711, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2712, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2716, net mprj/ic0_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2717, net mprj/ic0_mem_addr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2718, net mprj/ic0_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2719, net mprj/ic0_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2720, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2728, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2728, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2729, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2729, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2741, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2746, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2750, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2757, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2757, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2758, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2758, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2759, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2760, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2761, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2762, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2763, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2764, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2765, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2773, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2778, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2778, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2779, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2788, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2793, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2797, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2804, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2804, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2805, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2805, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2806, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2806, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2807, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2808, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2809, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2810, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2811, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2812, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2813, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2814, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2815, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2819, net mprj/dcache_mem_i_data\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2820, net mprj/dcache_mem_o_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2821, net mprj/dcache_wb_4_burst not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2822, net mprj/dcache_wb_adr\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2823, net mprj/dcache_wb_i_dat\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2824, net mprj/dcache_wb_o_dat\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2825, net mprj/ic0_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2826, net mprj/ic0_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2827, net mprj/ic0_mem_data\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2828, net mprj/ic0_mem_data\[24\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2829, net mprj/ic0_wb_adr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2830, net mprj/ic0_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2831, net mprj/ic1_mem_data\[21\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2832, net mprj/ic1_wb_adr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2833, net mprj/ic1_wb_i_dat\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2834, net mprj/ic1_wb_i_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2835, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2836, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2837, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2844, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2844, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2845, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2854, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2859, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2863, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2869, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2869, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2870, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2871, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2872, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2873, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2874, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2882, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2883, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2899, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2904, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2908, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2913, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2914, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2915, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2916, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2917, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2918, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2920, net mprj/dcache_mem_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2921, net mprj/dcache_mem_addr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2922, net mprj/dcache_mem_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2923, net mprj/dcache_mem_addr\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2924, net mprj/dcache_mem_i_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2925, net mprj/dcache_mem_o_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2926, net mprj/dcache_mem_o_data\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2927, net mprj/dcache_wb_i_dat\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2928, net mprj/ic0_clk not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2929, net mprj/ic0_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2930, net mprj/ic0_mem_cache_flush not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2931, net mprj/ic1_mem_data\[29\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2932, net mprj/ic1_mem_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2933, net mprj/ic1_mem_data\[30\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2934, net mprj/ic1_mem_data\[31\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2935, net mprj/ic1_mem_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2936, net mprj/ic1_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2937, net mprj/ic1_wb_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2938, net mprj/ic1_wb_adr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2939, net mprj/ic1_wb_adr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2940, net mprj/ic1_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2941, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2942, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2943, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2966, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2971, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2975, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2982, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2983, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2984, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2985, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2986, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2987, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2987, net mprj/iram_clk not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2994, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2994, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2995, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2995, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 2996, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3004, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3009, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3013, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3020, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3020, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3021, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3022, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3023, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3024, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3046, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3051, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3055, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3062, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3063, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3064, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3070, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3071, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3072, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3073, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3074, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3075, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3076, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3092, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3115, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3116, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3116, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3126, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3131, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3135, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3140, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3140, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3141, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3141, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3142, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3142, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3143, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3143, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3144, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3144, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3145, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3146, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3147, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3148, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3149, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3150, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3151, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3152, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3153, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3154, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3155, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3156, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3157, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3158, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3159, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3160, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3161, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3162, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3163, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3164, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3165, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3167, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3167, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3175, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3180, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3184, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3191, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3192, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3192, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3193, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3193, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3194, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3195, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3196, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3197, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3198, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3199, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3200, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3201, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3202, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3203, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3204, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3205, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3206, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3207, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3208, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3209, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3212, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3213, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3214, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3215, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3216, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3233, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3233, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3234, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3234, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3236, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3245, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3250, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3254, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3266, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3267, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3268, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3269, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3270, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3271, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3272, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3273, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3274, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3275, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3276, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3277, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3285, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3286, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3293, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3318, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3323, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3327, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3338, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3338, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3339, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3340, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3341, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3356, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3373, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3378, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3382, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3393, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3393, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3394, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3394, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3395, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3395, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3396, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3397, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3398, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3399, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3400, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3401, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3402, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3403, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3404, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3405, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3406, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3407, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3408, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3409, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3415, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3416, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3420, net mprj/iram_i_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3421, net mprj/iram_i_data\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3427, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3430, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3430, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3431, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3431, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3432, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3432, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3450, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3455, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3459, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3466, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3466, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3467, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3468, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3469, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3470, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3479, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3479, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3490, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3495, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3499, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3508, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3509, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3510, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3511, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3512, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3523, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3523, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3536, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3541, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3545, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3552, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3552, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3553, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3554, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3555, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3556, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3557, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3558, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3559, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3561, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3562, net mprj/c1_i_req_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3563, net mprj/c1_o_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3564, net mprj/c1_o_mem_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3576, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3576, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3584, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3589, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3593, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3601, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3602, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3603, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3604, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3605, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3606, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3607, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3608, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3609, net mprj/c0_o_mem_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3610, net mprj/c0_o_req_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3611, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3612, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3613, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3614, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3620, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3622, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3623, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3631, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3632, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3633, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3647, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3652, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3656, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3668, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3668, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3669, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3670, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3671, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3672, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3673, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3674, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3680, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3681, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3682, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3683, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3684, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3685, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3686, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3687, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3688, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3689, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3693, net mprj/iram_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3694, net mprj/iram_addr\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3695, net mprj/iram_addr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3696, net mprj/iram_addr\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3697, net mprj/iram_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3698, net mprj/iram_addr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3699, net mprj/iram_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3700, net mprj/iram_i_data\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3701, net mprj/iram_i_data\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3702, net mprj/iram_i_data\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3703, net mprj/iram_i_data\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3704, net mprj/iram_i_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3705, net mprj/iram_i_data\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3706, net mprj/iram_i_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3707, net mprj/iram_i_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3708, net mprj/iram_i_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3709, net mprj/iram_i_data\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3723, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3741, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3746, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3750, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3760, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3761, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3762, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3763, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3772, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3773, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3789, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3800, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3805, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3809, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3817, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3817, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3818, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3819, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3820, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3821, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3822, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3823, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3824, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3825, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3826, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3827, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3828, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3829, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3836, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3846, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3846, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3847, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3847, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3860, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3865, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3869, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3881, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3881, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3882, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3883, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3884, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3885, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3886, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3887, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3888, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3889, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3894, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3901, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3901, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3902, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3902, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3903, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3906, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3919, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3924, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3928, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3937, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3938, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3939, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3940, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3941, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3948, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3969, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3974, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3978, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3983, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3983, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3984, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3985, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3986, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3987, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3988, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3998, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3998, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 3999, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4000, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4001, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4008, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4013, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4017, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4024, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4024, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4025, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4026, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4027, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4028, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4040, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4049, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4054, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4058, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4063, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4064, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4065, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4066, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4067, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4068, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4069, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4070, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4071, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4085, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4085, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4086, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4093, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4098, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4102, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4109, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4110, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4111, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4127, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4127, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4128, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4137, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4142, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4146, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4151, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4152, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4153, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4154, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4155, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4156, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4157, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4158, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4159, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4160, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4161, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4162, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4163, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4180, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4185, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4189, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4195, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4196, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4197, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4198, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4199, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4200, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4215, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4215, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4216, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4227, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4232, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4236, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4245, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4246, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4247, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4248, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4249, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4250, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4251, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4252, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4253, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4254, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4255, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4256, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4257, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4264, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4277, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4283, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4293, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4293, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4294, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4294, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4295, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4296, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4297, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4297, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4298, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4311, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4316, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4320, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4330, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4331, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4336, net mprj/dcache not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4337, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4338, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4359, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4360, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4378, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4383, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4387, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4393, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4396, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4402, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4405, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4414, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4418, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4441, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4442, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4443, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4463, net mprj/dcache_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4464, net mprj/dcache_mem_i_data\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4468, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4469, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4470, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4471, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4482, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4496, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4500, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4514, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4515, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4527, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4528, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4529, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4530, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4536, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4550, net mprj/dcache_mem_o_data\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4551, net mprj/dcache_wb_err not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4552, net mprj/dcache_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4553, net mprj/ic0_mem_req not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4554, net mprj/ic0_wb_adr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4555, net mprj/ic1_mem_data\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4556, net mprj/ic1_wb_i_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4561, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4572, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4586, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4590, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4613, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4614, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4615, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4616, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4635, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4636, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4637, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4638, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4639, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4640, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4647, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4660, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4664, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4673, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4685, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4686, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4687, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4712, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4713, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4714, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4715, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4724, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4737, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4741, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4750, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4757, net mprj/dcache_mem_addr\[19\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4758, net mprj/dcache_mem_o_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4759, net mprj/dcache_wb_we not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4760, net mprj/ic0_mem_ack not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4761, net mprj/ic1_mem_data\[23\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4762, net mprj/ic1_wb_adr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4763, net mprj/ic1_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4764, net mprj/ic1_wb_sel\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4765, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4766, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4767, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4769, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4780, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4784, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4806, net mprj/ic0_mem_addr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4807, net mprj/ic0_mem_addr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4808, net mprj/ic0_mem_data\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4812, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4813, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4814, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4822, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4833, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4837, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4847, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4848, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4849, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4850, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4851, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4852, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4865, net mprj/dcache_mem_addr\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4866, net mprj/dcache_mem_addr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4867, net mprj/dcache_mem_o_data\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4868, net mprj/dcache_wb_i_dat\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4869, net mprj/dcache_wb_o_dat\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4870, net mprj/ic0_mem_addr\[0\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4871, net mprj/ic1_mem_data\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4872, net mprj/ic1_wb_i_dat\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4875, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4876, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4884, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4895, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4899, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4910, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4919, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4920, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4929, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4940, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4944, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4963, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4970, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4983, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4984, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4985, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 4992, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5005, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5009, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5018, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5019, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5020, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5021, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5022, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5023, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5042, net mprj/ic1_mem_data\[26\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5044, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5045, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5046, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5047, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5048, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5049, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5055, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5066, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5070, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5091, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5092, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5104, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5115, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5119, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5144, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5145, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5146, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5162, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5163, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5164, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5165, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5166, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5167, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5168, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5169, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5170, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5171, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5172, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5173, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5174, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5175, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5176, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5177, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5178, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5179, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5180, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5181, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5182, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5183, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5184, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5185, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5186, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5187, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5188, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5189, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5190, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5191, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5192, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5193, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5194, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5195, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5196, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5197, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5198, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5203, net mprj/dcache_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5204, net mprj/dcache_mem_addr\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5205, net mprj/dcache_mem_addr\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5206, net mprj/dcache_mem_cache_enable not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5207, net mprj/dcache_mem_i_data\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5208, net mprj/dcache_mem_i_data\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5209, net mprj/dcache_mem_i_data\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5210, net mprj/dcache_mem_i_data\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5211, net mprj/dcache_mem_o_data\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5212, net mprj/dcache_mem_we not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5213, net mprj/dcache_wb_adr\[1\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5214, net mprj/dcache_wb_i_dat\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5215, net mprj/dcache_wb_i_dat\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5216, net mprj/ic0_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5217, net mprj/ic0_mem_addr\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5218, net mprj/ic0_mem_addr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5219, net mprj/ic0_mem_addr\[5\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5220, net mprj/ic0_mem_data\[26\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5221, net mprj/ic0_wb_i_dat\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5222, net mprj/ic1_mem_addr\[10\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5223, net mprj/ic1_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5224, net mprj/ic1_mem_addr\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5225, net mprj/ic1_mem_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5226, net mprj/ic1_mem_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5227, net mprj/ic1_mem_addr\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5228, net mprj/ic1_mem_addr\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5229, net mprj/ic1_mem_addr\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5230, net mprj/ic1_mem_addr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5231, net mprj/ic1_mem_data\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5232, net mprj/ic1_wb_i_dat\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5233, net mprj/ic1_wb_i_dat\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5234, net mprj/ic1_wb_i_dat\[2\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5235, net mprj/ic1_wb_i_dat\[3\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5236, net mprj/ic1_wb_i_dat\[4\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5237, net mprj/ic1_wb_i_dat\[6\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5238, net mprj/ic1_wb_i_dat\[7\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5239, net mprj/ic1_wb_i_dat\[8\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5240, net mprj/ic1_wb_i_dat\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5242, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5243, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5250, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5263, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5267, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5280, net mprj/interconnect_inner not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5282, net mprj/c0_dbg_pc\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5283, net mprj/c0_i_core_int_sreg\[11\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5284, net mprj/c0_i_core_int_sreg\[12\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5285, net mprj/c0_i_core_int_sreg\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5286, net mprj/c0_i_req_data\[16\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5287, net mprj/c1_dbg_pc\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5289, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5290, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5291, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5301, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5312, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5316, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5325, net mprj/int_ram not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5334, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5335, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5341, net mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5352, instance mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5356, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5361, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5362, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5363, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5364, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5365, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5366, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5367, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5368, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5369, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5370, net mprj/interconnect_outer not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5383, net mprj/c0_sr_bus_addr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5384, net mprj/c0_sr_bus_addr\[9\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5385, net mprj/c1_sr_bus_addr\[13\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5386, net mprj/c1_sr_bus_addr\[14\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5387, net mprj/c1_sr_bus_addr\[15\] not found.
[WARNING STA-0174] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5388, net mprj/c1_sr_bus_addr\[2\] not found.
[WARNING STA-0174] message limit reached, this message will no longer print
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5411, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5469, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5542, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5591, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5638, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5686, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5735, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5774, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5846, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5930, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 5998, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6056, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6137, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6179, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6223, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6277, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6327, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6367, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6412, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6459, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6552, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6718, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6793, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6836, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6906, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 6953, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7018, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7090, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7172, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7227, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7273, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7320, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7410, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7526, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7574, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7659, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7708, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7765, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7838, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7889, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 7939, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8004, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8062, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8128, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8177, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8221, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8271, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8332, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8389, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8449, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8498, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8542, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8590, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8628, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8672, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8723, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8769, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8824, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 8934, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9009, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9097, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9139, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9195, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9256, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9352, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9394, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9442, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9513, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9560, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9609, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9659, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9714, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9768, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9830, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9874, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9919, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 9976, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10009, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10054, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10112, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10157, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10198, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10243, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10286, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10326, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10368, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10409, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10458, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10500, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10539, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10579, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10631, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10668, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10715, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10754, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10791, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10821, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10860, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10905, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10949, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 10987, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11042, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11083, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11129, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11178, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11230, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11301, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11343, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11404, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11446, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11491, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11528, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11579, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11664, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11698, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11756, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11792, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11828, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11888, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11940, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 11985, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12030, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12070, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12139, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12179, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12217, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12255, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12304, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12358, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12413, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12457, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12497, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12556, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12601, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12649, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12696, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12733, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12781, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12818, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12879, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12931, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 12973, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13013, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13059, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13097, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13143, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13198, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13242, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13284, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13328, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13382, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13420, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13462, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13500, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13534, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13585, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13658, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13713, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13760, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13800, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13847, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13914, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 13953, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14000, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14046, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14082, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14125, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14179, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14227, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14273, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14318, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14362, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14426, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14470, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14505, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14548, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14594, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14638, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14709, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14770, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14821, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14861, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14902, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14941, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 14987, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15040, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15084, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15125, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15168, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15212, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15261, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15306, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15347, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15389, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15433, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15477, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15520, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15561, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15607, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15653, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15706, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15746, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15794, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15843, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15898, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15951, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 15993, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16037, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16088, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16128, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16174, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16239, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16285, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16330, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16369, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16402, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16440, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16474, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16513, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16547, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16588, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16618, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16653, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16688, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16731, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16774, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16808, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16849, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16877, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16918, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 16980, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17026, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17066, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17114, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17159, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17206, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17257, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17290, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17333, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17376, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17458, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17507, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17549, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17593, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17636, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17685, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17723, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17769, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17808, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17859, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17898, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17940, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 17974, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18015, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18056, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18108, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18152, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18197, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18241, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18282, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18321, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18368, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18406, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18446, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18486, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18536, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18580, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18633, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18677, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18722, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18754, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18795, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18837, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18875, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18914, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 18964, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19016, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19056, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19093, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19137, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19174, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19218, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19267, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19356, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19402, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19449, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19494, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19542, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19581, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19625, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19671, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19724, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19766, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19805, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19846, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19883, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19927, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 19977, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20016, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20056, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20096, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20133, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20186, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20237, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20271, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20315, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20356, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20401, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20445, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20493, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20533, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20579, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20625, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20669, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20729, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20765, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20809, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20845, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20888, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20941, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 20984, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21030, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21073, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21119, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21167, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21216, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21263, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21304, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21345, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21386, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21432, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21481, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21519, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21557, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21609, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21658, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21694, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21725, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21765, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21805, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21844, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21887, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21939, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 21967, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22003, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22040, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22087, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22121, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22155, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22198, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22235, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22276, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22324, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22367, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22403, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22447, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22485, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22523, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22565, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22606, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22649, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22687, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22734, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22782, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22831, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22871, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22915, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 22962, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23004, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23042, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23079, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23124, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23202, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23247, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23298, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23338, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23381, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23418, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23462, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23505, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23543, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23591, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23637, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23681, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23733, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23773, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23821, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23862, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23902, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23952, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 23999, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24039, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24087, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24129, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24171, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24213, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24255, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24299, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24343, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24380, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24424, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24464, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24520, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24561, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24601, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24650, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24701, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24743, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24795, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24836, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24893, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24934, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 24979, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25022, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25059, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25107, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25149, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25194, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25248, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25302, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25346, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25399, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25444, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25487, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25539, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25608, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25660, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25719, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25760, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25823, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25870, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25913, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 25972, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26023, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26102, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26145, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26197, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26239, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26292, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26336, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26376, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26431, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26481, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26522, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26568, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26610, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26695, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26737, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26775, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26813, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26847, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26897, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26944, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 26989, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27039, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27087, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27138, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27178, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27233, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27272, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27316, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27353, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27392, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27439, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27482, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27520, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27564, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27605, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27646, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27693, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27740, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27781, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27822, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27863, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27904, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27949, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 27988, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28032, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28077, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28130, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28165, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28209, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28243, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28289, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28328, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28368, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28408, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28453, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28500, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28541, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28577, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28614, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28655, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28692, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28734, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28776, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28820, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28865, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28911, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28954, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 28998, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29036, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29072, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29112, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29154, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29193, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29230, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29273, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29309, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29348, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29389, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29432, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29476, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29514, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29553, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29592, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29636, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29690, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29727, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29770, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29807, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29848, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29892, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29932, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 29963, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30002, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30041, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30083, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30132, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30186, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30227, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30266, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30310, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30355, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30394, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30439, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30482, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30530, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30579, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30629, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30674, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30727, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30767, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30817, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30864, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30923, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 30977, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31030, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31070, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31110, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31154, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31195, instance mprj/interconnect_outer not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31232, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31233, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31257, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31258, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31303, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31304, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31337, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31338, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31369, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31370, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31404, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31405, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31436, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31437, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31471, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31472, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31535, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31536, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31574, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31575, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31621, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31622, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31657, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31658, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31696, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31697, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31725, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31726, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31763, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31764, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31802, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31803, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31840, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31841, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31876, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31877, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31914, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31915, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31952, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31953, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31989, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 31990, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32030, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32031, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32069, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32070, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32107, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32108, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32150, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32151, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32192, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32193, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32233, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32234, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32264, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32265, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32296, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32297, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32330, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32331, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32361, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32362, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32396, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32397, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32433, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32434, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32473, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32474, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32509, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32510, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32542, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32543, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32575, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32576, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32606, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32607, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32636, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32637, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32673, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32674, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32710, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32711, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32865, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32866, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32902, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32903, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32937, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32938, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32974, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 32975, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33007, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33008, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33054, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33055, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33093, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33094, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33129, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33130, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33162, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33163, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33198, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33199, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33231, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33232, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33260, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33261, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33306, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33307, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33347, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33348, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33384, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33385, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33418, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33419, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33456, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33457, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33490, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33491, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33530, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33531, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33573, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33574, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33605, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33606, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33643, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33644, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33686, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33687, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33730, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33731, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33770, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33771, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33807, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33808, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33841, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33842, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33873, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33874, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33907, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33908, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33942, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33943, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33977, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 33978, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34015, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34016, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34049, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34050, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34078, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34079, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34115, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34116, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34155, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34156, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34191, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34192, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34230, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34231, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34269, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34270, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34311, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34312, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34367, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34368, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34404, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34405, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34471, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34472, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34504, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34505, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34541, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34542, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34572, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34573, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34609, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34610, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34642, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34643, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34675, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34676, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34709, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34710, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34749, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34750, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34787, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34788, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34819, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34820, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34850, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34851, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34880, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34881, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34914, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34915, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34957, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34958, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34992, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 34993, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35031, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35032, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35061, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35062, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35097, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35098, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35133, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35134, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35163, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35164, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35216, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35217, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35252, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35253, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35288, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35289, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35325, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35326, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35358, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35359, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35392, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35393, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35433, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35434, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35473, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35474, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35509, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35510, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35542, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35543, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35581, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35582, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35616, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35617, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35648, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35649, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35684, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35685, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35761, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35762, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35796, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35797, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35834, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35835, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35888, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35889, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35925, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35926, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35958, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35959, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35993, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 35994, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36027, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36028, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36062, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36063, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36100, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36101, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36134, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36135, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36171, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36172, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36211, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36212, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36251, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36252, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36289, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36290, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36324, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36325, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36363, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36364, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36398, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36399, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36434, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36435, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36472, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36473, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36505, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36506, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36539, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36540, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36575, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36576, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36613, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36614, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36649, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36650, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36686, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36687, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36722, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36723, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36763, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36764, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36802, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36803, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36840, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36841, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36877, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36878, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36914, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36915, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36949, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36950, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36984, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 36985, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37022, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37023, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37063, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37064, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37100, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37101, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37132, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37133, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37162, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37163, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37202, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37203, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37248, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37249, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37280, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37281, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37312, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37313, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37348, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37349, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37382, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37383, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37421, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37422, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37460, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37461, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37502, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37503, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37539, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37540, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37581, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37582, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37621, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37622, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37661, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37662, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37697, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37698, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37731, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37732, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37768, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37769, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37805, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37806, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37836, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37837, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37873, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37874, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37913, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37914, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37951, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37952, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37986, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 37987, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38026, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38027, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38065, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38066, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38102, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38103, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38142, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38143, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38182, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38183, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38220, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38221, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38256, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38257, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38298, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38299, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38332, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38333, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38370, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38371, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38406, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38407, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38442, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38443, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38478, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38479, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38516, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38517, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38549, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38550, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38583, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38584, instance mprj/core0 not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38619, instance mprj/interconnect_inner not found.
[WARNING STA-0172] /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef line 38620, instance mprj/core0 not found.
[WARNING STA-0172] message limit reached, this message will no longer print
spef: /home/piotro/caravel_user_project/signoff/user_project_wrapper/openlane-signoff/spef/user_project_wrapper.nom.spef
def: /home/piotro/caravel_user_project/def/user_project_wrapper.def
rcx: /home/piotro/opt/silicon/pdks/sky130A/libs.tech//openlane/rules.openrcx.sky130A.nom.calibre
rcx-corner: nom
lib-corner: t.tcl
tech_lef: /home/piotro/opt/silicon/pdks/sky130A/libs.ref//sky130_fd_sc_hd/techlef/sky130_fd_sc_hd__nom.tlef
