## INPUT CLOCK
create_clock [get_ports {"clk_m"} ] -name "clk_m" -period 10
create_clock [get_ports {"clk_s"} ] -name "clk_s" -period 10

set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_rst}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_4_burst}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_8_burst}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_adr[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_cyc}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_o_dat[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_sel[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_sel[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_stb}]
set_input_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_we}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_rst}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_ack}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_err}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_i_dat[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_ack}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_err}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_m}] -add_delay [get_ports {m_wb_i_dat[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_4_burst}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_8_burst}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_adr[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_cyc}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_o_dat[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_sel[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_sel[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_stb}]
set_output_delay 2.0000 -clock [get_clocks {clk_s}] -add_delay [get_ports {s_wb_we}]

set_max_fanout $::env(SYNTH_MAX_FANOUT) [current_design]

set_driving_cell -lib_cell $::env(SYNTH_DRIVING_CELL) -pin $::env(SYNTH_DRIVING_CELL_PIN) [all_inputs]
set cap_load [expr $::env(SYNTH_CAP_LOAD) / 1000.0]
set_load  $cap_load [all_outputs]

set_timing_derate -early [expr {1-$::env(SYNTH_TIMING_DERATE)}]
set_timing_derate -late [expr {1+$::env(SYNTH_TIMING_DERATE)}]
set_clock_uncertainty $::env(SYNTH_CLOCK_UNCERTAINITY) [get_clocks {clk_m}]
set_clock_transition $::env(SYNTH_CLOCK_TRANSITION) [get_clocks {clk_m}]
set_clock_uncertainty $::env(SYNTH_CLOCK_UNCERTAINITY) [get_clocks {clk_s}]
set_clock_transition $::env(SYNTH_CLOCK_TRANSITION) [get_clocks {clk_s}]