###############################################################################
# Created by write_sdc
# Tue Sep 13 06:44:34 2022
###############################################################################
current_design uprj_w_const
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_clk_i}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_dir}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_dir_b_o}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_req_i}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_rst_i}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_i[0]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_i[1]}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_i[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[11]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[12]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[13]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[14]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[15]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[16]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[17]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[18]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[19]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[20]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[21]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[22]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[23]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[24]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[25]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[26]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[27]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[28]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[29]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[30]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[31]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[32]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[33]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[34]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[35]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[36]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[37]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[38]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[39]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[40]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[41]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[42]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[43]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[44]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[45]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[46]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[47]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[48]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[49]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[50]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[51]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[52]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[53]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[54]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[55]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[56]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[57]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[58]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[59]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[60]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[61]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[62]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[63]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[64]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[65]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[66]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[67]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[68]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[69]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[70]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[71]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[72]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[73]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[74]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[75]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[76]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[77]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[78]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[79]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[80]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[81]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[82]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {b0_drv[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_clk_o}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_dir_b_oo}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_dir_o}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_req_o}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {cw_rst_o}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[11]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[12]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[13]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[14]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[15]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_15_0[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_18_16[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_18_16[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_18_16[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_20_19[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_20_19[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_21}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_oeb_22}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out_20_19[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out_20_19[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {io_out_22}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_16_17[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_16_17[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_21}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_37_36[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_37_36[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[11]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[12]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[13]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[14]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[15]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_77_62[9]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_97_95[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_97_95[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_data_out_97_95[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_o[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_o[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {la_datb_o[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[0]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[10]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[11]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[12]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[13]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[14]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[1]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[2]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[3]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[4]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[5]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[6]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[7]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[8]}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {oeb_out[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {cw_clk_o}]
set_load -pin_load 0.0334 [get_ports {cw_dir_b_oo}]
set_load -pin_load 0.0334 [get_ports {cw_dir_o}]
set_load -pin_load 0.0334 [get_ports {cw_req_o}]
set_load -pin_load 0.0334 [get_ports {cw_rst_o}]
set_load -pin_load 0.0334 [get_ports {io_oeb_21}]
set_load -pin_load 0.0334 [get_ports {io_oeb_22}]
set_load -pin_load 0.0334 [get_ports {io_out_22}]
set_load -pin_load 0.0334 [get_ports {la_data_out_21}]
set_load -pin_load 0.0334 [get_ports {b0_drv[82]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[81]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[80]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[79]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[78]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[77]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[76]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[75]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[74]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[73]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[72]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[71]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[70]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[69]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[68]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[67]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[66]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[65]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[64]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[63]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[62]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[61]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[60]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[59]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[58]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[57]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[56]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[55]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[54]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[53]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[52]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[51]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[50]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[49]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[48]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[47]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[46]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[45]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[44]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[43]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[42]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[41]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[40]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[39]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[38]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[37]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[36]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[35]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[34]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[33]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[32]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[31]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[30]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[29]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[28]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[27]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[26]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[25]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[24]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[23]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[22]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[21]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[20]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[19]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[18]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[17]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[16]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[15]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[14]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[13]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[12]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[11]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[10]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[9]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[8]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[7]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[6]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[5]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[4]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[3]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[2]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[1]}]
set_load -pin_load 0.0334 [get_ports {b0_drv[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[15]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[14]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_15_0[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_18_16[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_18_16[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_18_16[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_20_19[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb_20_19[0]}]
set_load -pin_load 0.0334 [get_ports {io_out[14]}]
set_load -pin_load 0.0334 [get_ports {io_out[13]}]
set_load -pin_load 0.0334 [get_ports {io_out[12]}]
set_load -pin_load 0.0334 [get_ports {io_out[11]}]
set_load -pin_load 0.0334 [get_ports {io_out[10]}]
set_load -pin_load 0.0334 [get_ports {io_out[9]}]
set_load -pin_load 0.0334 [get_ports {io_out[8]}]
set_load -pin_load 0.0334 [get_ports {io_out[7]}]
set_load -pin_load 0.0334 [get_ports {io_out[6]}]
set_load -pin_load 0.0334 [get_ports {io_out[5]}]
set_load -pin_load 0.0334 [get_ports {io_out[4]}]
set_load -pin_load 0.0334 [get_ports {io_out[3]}]
set_load -pin_load 0.0334 [get_ports {io_out[2]}]
set_load -pin_load 0.0334 [get_ports {io_out[1]}]
set_load -pin_load 0.0334 [get_ports {io_out[0]}]
set_load -pin_load 0.0334 [get_ports {io_out_20_19[1]}]
set_load -pin_load 0.0334 [get_ports {io_out_20_19[0]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_16_17[1]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_16_17[0]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_37_36[1]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_37_36[0]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[15]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[14]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[13]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[12]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[11]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[10]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[9]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[8]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[7]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[6]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[5]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[4]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[3]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[2]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[1]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_77_62[0]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_97_95[2]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_97_95[1]}]
set_load -pin_load 0.0334 [get_ports {la_data_out_97_95[0]}]
set_load -pin_load 0.0334 [get_ports {la_datb_o[2]}]
set_load -pin_load 0.0334 [get_ports {la_datb_o[1]}]
set_load -pin_load 0.0334 [get_ports {la_datb_o[0]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[14]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[13]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[12]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[11]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[10]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[9]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[8]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[7]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[6]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[5]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[4]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[3]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[2]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[1]}]
set_load -pin_load 0.0334 [get_ports {oeb_out[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cw_clk_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cw_dir}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cw_dir_b_o}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cw_req_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {cw_rst_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_datb_i[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_datb_i[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {la_datb_i[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
